app/views/offers/_form.html.erb

      <%= f.label :shop_id %><br />
      <%= f.collection_select(:shop_id, current_user.shops.all, :id, :name, :prompt => 'Select', :class => 'form-control') %>
---
SELECT "shops".* FROM "shops" WHERE "shops"."user_id" = $1  [["user_id", 1]]