app/views/offers/index.html.erb

        <td><%= offer.discount %></td>
        <td><%= offer.shop.name if !offer.shop.blank?%></td>
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]