app/controllers/offers_controller.rb

   def index
    @offers = Offer.all
---
SELECT "offers".* FROM "offers"

  def show
    @offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", 2]]

  def edit
    @offer = Offer.find(params[:id])
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    @offer = Offer.new(offer_params)

    respond_to do |format|
      if @offer.save
---
INSERT INTO "offers" ("name", "description", "start_date", "end_date", "status", "brand", "product", "discount", "shop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @offer = Offer.find(params[:id])

    respond_to do |format|
      if @offer.update_attributes(offer_params)
---
SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "offers" SET "product" = $1, "updated_at" = $2 WHERE "offers"."id" = $3  [["product", "fwefwe"], ["updated_at", "2015-10-13 13:42:00.325879"], ["id", 2]]