app/controllers/shops_controller.rb

	  def index
    @shops = current_user.shops.all
---
SELECT "shops".* FROM "shops" WHERE "shops"."user_id" = $1  [["user_id", 1]]

  def show
    @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @shop = Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @shop = current_user.shops.new(shop_params)

    respond_to do |format|
      if @shop.save
---
INSERT INTO "shops" ("name", "phone", "info", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "shivshankar"], ["phone", "9887987"], ["info", "lkjkl"], ["user_id", 1], ["created_at", "2015-10-13 08:09:26.018300"], ["updated_at", "2015-10-13 08:09:26.018300"]]

  def update
    @shop = current_user.shops.find(params[:id])

    respond_to do |format|
      if @shop.update_attributes(shop_params)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."user_id" = $1 AND "shops"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 1]]
UPDATE "shops" SET "avatar" = $1, "updated_at" = $2 WHERE "shops"."id" = $3  [["avatar", "pack_slip_changes.png"], ["updated_at", "2015-10-13 08:50:00.431718"], ["id", 1]]